/* automatically generated by rust-bindgen 0.71.1 */

pub type __fd_mask = ::core::ffi::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize]
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::core::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::core::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"]
        [::core::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct irc_session_s {
    _unused: [u8; 0]
}
/// \brief A libircclient IRC session.
///
/// This structure describes an IRC session. Its members are internal to
/// libircclient, and should not be used directly.
pub type irc_session_t = irc_session_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct irc_dcc_session_s {
    _unused: [u8; 0]
}
/// \brief A libircclient DCC session.
///
/// This structure describes a DCC session used by libircclient.
/// Its members are internal to libircclient, and should not be used directly.
pub type irc_dcc_session_t = irc_dcc_session_s;
/// \brief A DCC session identifier.
///
/// The irc_dcc_t type is a DCC session identifier, used to identify the
/// DCC sessions in callbacks and various functions.
pub type irc_dcc_t = ::core::ffi::c_uint;
/// \fn typedef void (*irc_dcc_callback_t) (irc_session_t * session, irc_dcc_t
/// id, int status, void * ctx, const char * data, unsigned int length) \brief A
/// common DCC callback, used to inform you about the current DCC state or
/// event.
///
/// \param session An IRC session which generates the callback
/// \param id  A DCC session id.
/// \param status An error status. 0 means no error, otherwise error code.
/// \param ctx A user-supplied context.
/// \param data Data supplied (if available)
/// \param length data length (if available)
///
/// This callback is called for all DCC functions when state change occurs.
///
/// For DCC CHAT, the callback is called in next circumstances:
/// - \a status is LIBIRC_ERR_CLOSED: connection is closed by remote peer. After
///   returning from the callback, the DCC session is automatically destroyed.
/// - \a status is neither 0 nor LIBIRC_ERR_CLOSED: socket I/O error (connect
///   error, accept error, recv error, send error). After returning from the
///   callback, the DCC session is automatically destroyed.
/// - \a status is 0: new chat message received, \a data contains the message
///   (null-terminated string), \a length contains the message length.
///
/// For DCC SEND, while file is sending, callback called in next circumstances:
/// - \a status is neither 0 nor LIBIRC_ERR_CLOSED: socket I/O error (connect
///   error, accept error, recv error, send error). After returning from the
///   callback, the DCC session is automatically destroyed.
/// - \a status is 0: new data received, \a data contains the data received, \a
///   length contains the amount of data received.
///
/// For DCC RECV, while file is sending, callback called in next circumstances:
/// - \a status is neither 0 nor LIBIRC_ERR_CLOSED: socket I/O error (connect
///   error, accept error, recv error, send error). After returning from the
///   callback, the DCC session is automatically destroyed.
/// - \a status is 0, and \a data is 0: file has been received successfully.
///   After returning from the callback, the DCC session is automatically
///   destroyed.
/// - \a status is 0, and \a data is not 0: new data received, \a data contains
///   the data received, \a length contains the amount of data received.
///
/// \ingroup dccstuff
pub type irc_dcc_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        session: *mut irc_session_t,
        id: irc_dcc_t,
        status: ::core::ffi::c_int,
        ctx: *mut ::core::ffi::c_void,
        data: *const ::core::ffi::c_char,
        length: ::core::ffi::c_uint
    )
>;
/// \fn typedef void (*irc_event_callback_t) (irc_session_t * session, const
/// char * event, const char * origin, const char ** params, unsigned int count)
/// \brief A most common event callback
///
/// \param session the session, which generates an event
/// \param event   the text name of the event. Useful in case you use a single
///                event handler for several events simultaneously.
/// \param origin  the originator of the event. See the note below.
/// \param params  a list of event params. Depending on the event nature, it
///                could have zero or more params. The actual number of params
///                is specified in count. None of the params can be NULL, but
///                'params' pointer itself could be NULL for some events.
/// \param count   the total number of params supplied.
///
/// Every event generates a callback. This callback is generated by most events.
/// Depending on the event nature, it can provide zero or more params. For each
/// event, the number of provided params is fixed, and their meaning is
/// described.
///
/// Every event has origin, though the \a origin variable may be NULL, which
/// means that event origin is unknown. The origin usually looks like
/// nick!host\@ircserver, i.e. like tim!home\@irc.krasnogorsk.ru. Such origins
/// can not be used in IRC commands, and need to be stripped (i.e. host and
/// server part should be cut off) before using. This can be done either
/// explicitly, by calling irc_target_get_nick(), or implicitly for all the
/// events - by setting the #LIBIRC_OPTION_STRIPNICKS option with
/// irc_option_set().
///
/// \ingroup events
pub type irc_event_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        session: *mut irc_session_t,
        event: *const ::core::ffi::c_char,
        origin: *const ::core::ffi::c_char,
        params: *mut *const ::core::ffi::c_char,
        count: ::core::ffi::c_uint
    )
>;
/// \fn typedef void (*irc_eventcode_callback_t) (irc_session_t * session,
/// unsigned int event, const char * origin, const char ** params, unsigned int
/// count) \brief A numeric event callback
///
/// \param session the session, which generates an event
/// \param event   the numeric code of the event. Useful in case you use a
///                single event handler for several events simultaneously.
/// \param origin  the originator of the event. See the note below.
/// \param params  a list of event params. Depending on the event nature, it
///                could have zero or more params. The actual number of params
///                is specified in count. None of the params can be NULL, but
///                'params' pointer itself could be NULL for some events.
/// \param count   the total number of params supplied.
///
/// Most times in reply to your actions the IRC server generates numeric
/// callbacks. Most of them are error codes, and some of them mark list start
/// and list stop markers. Every code has its own set of params; for details
/// you can either experiment, or read RFC 1459.
///
/// Every event has origin, though the \a origin variable may be NULL, which
/// means that event origin is unknown. The origin usually looks like
/// nick!host\@ircserver, i.e. like tim!home\@irc.krasnogorsk.ru. Such origins
/// can not be used in IRC commands, and need to be stripped (i.e. host and
/// server part should be cut off) before using. This can be done either
/// explicitly, by calling irc_target_get_nick(), or implicitly for all the
/// events - by setting the #LIBIRC_OPTION_STRIPNICKS option with
/// irc_option_set().
///
/// \ingroup events
pub type irc_eventcode_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        session: *mut irc_session_t,
        event: ::core::ffi::c_uint,
        origin: *const ::core::ffi::c_char,
        params: *mut *const ::core::ffi::c_char,
        count: ::core::ffi::c_uint
    )
>;
/// \fn typedef void (*irc_event_dcc_chat_t) (irc_session_t * session, const
/// char * nick, const char * addr, irc_dcc_t dccid) \brief A remote DCC CHAT
/// request callback
///
/// \param session the session, which generates an event
/// \param nick    the person who requested DCC CHAT with you.
/// \param addr    the person's IP address in decimal-dot notation.
/// \param dccid   an id associated with this request. Use it in calls to
///                irc_dcc_accept() or irc_dcc_decline().
///
/// This callback is called when someone requests DCC CHAT with you. In respond
/// you should call either irc_dcc_accept() to accept chat request, or
/// irc_dcc_decline() to decline chat request.
///
/// \sa irc_dcc_accept or irc_dcc_decline
/// \ingroup events
pub type irc_event_dcc_chat_t = ::core::option::Option<
    unsafe extern "C" fn(
        session: *mut irc_session_t,
        nick: *const ::core::ffi::c_char,
        addr: *const ::core::ffi::c_char,
        dccid: irc_dcc_t
    )
>;
/// \fn typedef void (*irc_event_dcc_send_t) (irc_session_t * session, const
/// char * nick, const char * addr, const char * filename, unsigned long size,
/// irc_dcc_t dccid) \brief A remote DCC CHAT request callback
///
/// \param session the session, which generates an event
/// \param nick    the person who requested DCC CHAT with you.
/// \param addr    the person's IP address in decimal-dot notation.
/// \param filename the sent filename.
/// \param size    the filename size.
/// \param dccid   an id associated with this request. Use it in calls to
///                irc_dcc_accept() or irc_dcc_decline().
///
/// This callback is called when someone wants to send a file to you using
/// DCC SEND. As with chat, in respond you should call either irc_dcc_accept()
/// to accept this request and receive the file, or irc_dcc_decline() to
/// decline this request.
///
/// \sa irc_dcc_accept or irc_dcc_decline
/// \ingroup events
pub type irc_event_dcc_send_t = ::core::option::Option<
    unsafe extern "C" fn(
        session: *mut irc_session_t,
        nick: *const ::core::ffi::c_char,
        addr: *const ::core::ffi::c_char,
        filename: *const ::core::ffi::c_char,
        size: ::core::ffi::c_ulong,
        dccid: irc_dcc_t
    )
>;
/// \brief Event callbacks structure.
///
/// All the communication with the IRC network is based on events. Generally
/// speaking, event is anything generated by someone else in the network,
/// or by the IRC server itself. "Someone sends you a message", "Someone
/// has joined the channel", "Someone has quits IRC" - all these messages
/// are events.
///
/// Every event has its own event handler, which is called when the
/// appropriate event is received. You don't have to define all the event
/// handlers; define only the handlers for the events you need to intercept.
///
/// Most event callbacks are the types of ::irc_event_callback_t. There are
/// also events, which generate ::irc_eventcode_callback_t,
/// ::irc_event_dcc_chat_t and ::irc_event_dcc_send_t callbacks.
///
/// \ingroup events
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct irc_callbacks_t {
    /// The "on_connect" event is triggered when the client successfully
    /// connects to the server, and could send commands to the server.
    /// No extra params supplied; \a params is 0.
    pub event_connect: irc_event_callback_t,
    /// The "nick" event is triggered when the client receives a NICK message,
    /// meaning that someone (including you) on a channel with the client has
    /// changed their nickname.
    ///
    /// \param origin the person, who changes the nick. Note that it can be you!
    /// \param params[0] mandatory, contains the new nick.
    pub event_nick: irc_event_callback_t,
    /// The "quit" event is triggered upon receipt of a QUIT message, which
    /// means that someone on a channel with the client has disconnected.
    ///
    /// \param origin the person, who is disconnected
    /// \param params[0] optional, contains the reason message (user-specified).
    pub event_quit: irc_event_callback_t,
    /// The "join" event is triggered upon receipt of a JOIN message, which
    /// means that someone has entered a channel that the client is on.
    ///
    /// \param origin the person, who joins the channel. By comparing it with
    ///               your own nickname, you can check whether your JOIN
    ///               command succeed.
    /// \param params[0] mandatory, contains the channel name.
    pub event_join: irc_event_callback_t,
    /// The "part" event is triggered upon receipt of a PART message, which
    /// means that someone has left a channel that the client is on.
    ///
    /// \param origin the person, who leaves the channel. By comparing it with
    ///               your own nickname, you can check whether your PART
    ///               command succeed.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[1] optional, contains the reason message (user-defined).
    pub event_part: irc_event_callback_t,
    /// The "mode" event is triggered upon receipt of a channel MODE message,
    /// which means that someone on a channel with the client has changed the
    /// channel's parameters.
    ///
    /// \param origin the person, who changed the channel mode.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[1] mandatory, contains the changed channel mode, like
    ///        '+t', '-i' and so on.
    /// \param params[2] optional, contains the mode argument (for example, a
    ///      key for +k mode, or user who got the channel operator status for
    ///      +o mode)
    pub event_mode: irc_event_callback_t,
    /// The "umode" event is triggered upon receipt of a user MODE message,
    /// which means that your user mode has been changed.
    ///
    /// \param origin the person, who changed the channel mode.
    /// \param params[0] mandatory, contains the user changed mode, like
    ///        '+t', '-i' and so on.
    pub event_umode: irc_event_callback_t,
    /// The "topic" event is triggered upon receipt of a TOPIC message, which
    /// means that someone on a channel with the client has changed the
    /// channel's topic.
    ///
    /// \param origin the person, who changes the channel topic.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[1] optional, contains the new topic.
    pub event_topic: irc_event_callback_t,
    /// The "kick" event is triggered upon receipt of a KICK message, which
    /// means that someone on a channel with the client (or possibly the
    /// client itself!) has been forcibly ejected.
    ///
    /// \param origin the person, who kicked the poor.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[0] optional, contains the nick of kicked person.
    /// \param params[1] optional, contains the kick text
    pub event_kick: irc_event_callback_t,
    /// The "channel" event is triggered upon receipt of a PRIVMSG message
    /// to an entire channel, which means that someone on a channel with
    /// the client has said something aloud. Your own messages don't trigger
    /// PRIVMSG event.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[1] optional, contains the message text
    pub event_channel: irc_event_callback_t,
    /// The "privmsg" event is triggered upon receipt of a PRIVMSG message
    /// which is addressed to one or more clients, which means that someone
    /// is sending the client a private message.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, contains your nick.
    /// \param params[1] optional, contains the message text
    pub event_privmsg: irc_event_callback_t,
    /// The "notice" event is triggered upon receipt of a NOTICE message
    /// which means that someone has sent the client a public or private
    /// notice. According to RFC 1459, the only difference between NOTICE
    /// and PRIVMSG is that you should NEVER automatically reply to NOTICE
    /// messages. Unfortunately, this rule is frequently violated by IRC
    /// servers itself - for example, NICKSERV messages require reply, and
    /// are NOTICEs.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, contains the target nick name.
    /// \param params[1] optional, contains the message text
    pub event_notice: irc_event_callback_t,
    /// The "channel_notice" event is triggered upon receipt of a NOTICE
    /// message which means that someone has sent the client a public
    /// notice. According to RFC 1459, the only difference between NOTICE
    /// and PRIVMSG is that you should NEVER automatically reply to NOTICE
    /// messages. Unfortunately, this rule is frequently violated by IRC
    /// servers itself - for example, NICKSERV messages require reply, and
    /// are NOTICEs.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, contains the channel name.
    /// \param params[1] optional, contains the message text
    pub event_channel_notice: irc_event_callback_t,
    /// The "invite" event is triggered upon receipt of an INVITE message,
    /// which means that someone is permitting the client's entry into a +i
    /// channel.
    ///
    /// \param origin the person, who INVITEs you.
    /// \param params[0] mandatory, contains your nick.
    /// \param params[1] mandatory, contains the channel name you're invited
    /// into.
    ///
    /// \sa irc_cmd_invite irc_cmd_chanmode_invite
    pub event_invite: irc_event_callback_t,
    /// The "ctcp" event is triggered when the client receives the CTCP
    /// request. By default, the built-in CTCP request handler is used. The
    /// build-in handler automatically replies on most CTCP messages, so you
    /// will rarely need to override it.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, the complete CTCP message, including its
    ///                  arguments.
    ///
    /// Mirc generates PING, FINGER, VERSION, TIME and ACTION messages,
    /// check the source code of \c libirc_event_ctcp_internal function to
    /// see how to write your own CTCP request handler. Also you may find
    /// useful this question in FAQ: \ref faq4
    pub event_ctcp_req: irc_event_callback_t,
    /// The "ctcp" event is triggered when the client receives the CTCP reply.
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, the CTCP message itself with its arguments.
    pub event_ctcp_rep: irc_event_callback_t,
    /// The "action" event is triggered when the client receives the CTCP
    /// ACTION message. These messages usually looks like:\n
    /// \code
    /// [23:32:55] * Tim gonna sleep.
    /// \endcode
    ///
    /// \param origin the person, who generates the message.
    /// \param params[0] mandatory, the ACTION message.
    pub event_ctcp_action: irc_event_callback_t,
    /// The "unknown" event is triggered upon receipt of any number of
    /// unclassifiable miscellaneous messages, which aren't handled by the
    /// library.
    pub event_unknown: irc_event_callback_t,
    /// The "numeric" event is triggered upon receipt of any numeric response
    /// from the server. There is a lot of such responses, see the full list
    /// here: \ref rfcnumbers.
    ///
    /// See the params in ::irc_eventcode_callback_t specification.
    pub event_numeric: irc_eventcode_callback_t,
    /// The "dcc chat" event is triggered when someone requests a DCC CHAT from
    /// you.
    ///
    /// See the params in ::irc_event_dcc_chat_t specification.
    pub event_dcc_chat_req: irc_event_dcc_chat_t,
    /// The "dcc chat" event is triggered when someone wants to send a file
    /// to you via DCC SEND request.
    ///
    /// See the params in ::irc_event_dcc_send_t specification.
    pub event_dcc_send_req: irc_event_dcc_send_t
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of irc_callbacks_t"][::core::mem::size_of::<irc_callbacks_t>() - 168usize];
    ["Alignment of irc_callbacks_t"][::core::mem::align_of::<irc_callbacks_t>() - 8usize];
    ["Offset of field: irc_callbacks_t::event_connect"]
        [::core::mem::offset_of!(irc_callbacks_t, event_connect) - 0usize];
    ["Offset of field: irc_callbacks_t::event_nick"]
        [::core::mem::offset_of!(irc_callbacks_t, event_nick) - 8usize];
    ["Offset of field: irc_callbacks_t::event_quit"]
        [::core::mem::offset_of!(irc_callbacks_t, event_quit) - 16usize];
    ["Offset of field: irc_callbacks_t::event_join"]
        [::core::mem::offset_of!(irc_callbacks_t, event_join) - 24usize];
    ["Offset of field: irc_callbacks_t::event_part"]
        [::core::mem::offset_of!(irc_callbacks_t, event_part) - 32usize];
    ["Offset of field: irc_callbacks_t::event_mode"]
        [::core::mem::offset_of!(irc_callbacks_t, event_mode) - 40usize];
    ["Offset of field: irc_callbacks_t::event_umode"]
        [::core::mem::offset_of!(irc_callbacks_t, event_umode) - 48usize];
    ["Offset of field: irc_callbacks_t::event_topic"]
        [::core::mem::offset_of!(irc_callbacks_t, event_topic) - 56usize];
    ["Offset of field: irc_callbacks_t::event_kick"]
        [::core::mem::offset_of!(irc_callbacks_t, event_kick) - 64usize];
    ["Offset of field: irc_callbacks_t::event_channel"]
        [::core::mem::offset_of!(irc_callbacks_t, event_channel) - 72usize];
    ["Offset of field: irc_callbacks_t::event_privmsg"]
        [::core::mem::offset_of!(irc_callbacks_t, event_privmsg) - 80usize];
    ["Offset of field: irc_callbacks_t::event_notice"]
        [::core::mem::offset_of!(irc_callbacks_t, event_notice) - 88usize];
    ["Offset of field: irc_callbacks_t::event_channel_notice"]
        [::core::mem::offset_of!(irc_callbacks_t, event_channel_notice) - 96usize];
    ["Offset of field: irc_callbacks_t::event_invite"]
        [::core::mem::offset_of!(irc_callbacks_t, event_invite) - 104usize];
    ["Offset of field: irc_callbacks_t::event_ctcp_req"]
        [::core::mem::offset_of!(irc_callbacks_t, event_ctcp_req) - 112usize];
    ["Offset of field: irc_callbacks_t::event_ctcp_rep"]
        [::core::mem::offset_of!(irc_callbacks_t, event_ctcp_rep) - 120usize];
    ["Offset of field: irc_callbacks_t::event_ctcp_action"]
        [::core::mem::offset_of!(irc_callbacks_t, event_ctcp_action) - 128usize];
    ["Offset of field: irc_callbacks_t::event_unknown"]
        [::core::mem::offset_of!(irc_callbacks_t, event_unknown) - 136usize];
    ["Offset of field: irc_callbacks_t::event_numeric"]
        [::core::mem::offset_of!(irc_callbacks_t, event_numeric) - 144usize];
    ["Offset of field: irc_callbacks_t::event_dcc_chat_req"]
        [::core::mem::offset_of!(irc_callbacks_t, event_dcc_chat_req) - 152usize];
    ["Offset of field: irc_callbacks_t::event_dcc_send_req"]
        [::core::mem::offset_of!(irc_callbacks_t, event_dcc_send_req) - 160usize];
};
unsafe extern "C" {
    /// \fn irc_session_t * irc_create_session (irc_callbacks_t * callbacks)
    /// \brief Creates and initiates a new IRC session.
    ///
    /// \param callbacks A structure, which defines several callbacks, which
    /// will                  be called on appropriate events. Must not be
    /// NULL.
    ///
    /// \return An ::irc_session_t object, or 0 if creation failed. Usually,
    ///         failure is caused by out of memory error.
    ///
    /// Every ::irc_session_t object describes a single IRC session - a
    /// connection to an IRC server, and possibly to some DCC clients.
    /// Almost every irc_* function requires this object to be passed to,
    /// and therefore this function should be called first.
    ///
    /// Every session created must be destroyed when it is not needed anymore
